# transport/car.py

class Car:
    """
    Базовий клас, що представляє машину.
    """

    def __init__(self, марка, модель, рік):
        """
        Ініціалізація базових параметрів машини.

        :param марка: марка машини
        :param модель: модель машини
        :param рік: рік випуску
        """
        self.марка = марка
        self.модель = модель
        self.рік = рік

    def показати_інформацію(self):
        """
        Виводить інформацію про машину.
        """
        print(f"Машина: {self.марка} {self.модель}, {self.рік} рік")

    def запустити_двигун(self):
        """
        Запускає двигун.
        """
        print(f"Двигун {self.марка} {self.модель} запущено.")
