# transport/truck.py

from .car import Car


class Truck(Car):
    """
    Похідний клас, що представляє вантажівку.
    """

    def __init__(self, марка, модель, рік, макс_вантажопідйомність):
        """
        Ініціалізація параметрів вантажівки.

        :param марка: марка вантажівки
        :param модель: модель вантажівки
        :param рік: рік випуску
        :param макс_вантажопідйомність: максимальна вантажопідйомність
        """
        super().__init__(марка, модель, рік)
        self.макс_вантажопідйомність = макс_вантажопідйомність

    def показати_інформацію(self):
        """
        Виводить інформацію про вантажівку.
        """
        super().показати_інформацію()
        print(f"Максимальна вантажопідйомність: {self.макс_вантажопідйомність} кг")

    def завантажити_вантаж(self, вага):
        """
        Завантажує вантаж, якщо він не перевищує максимальну вантажопідйомність.

        :param вага: вага вантажу
        """
        if вага <= self.макс_вантажопідйомність:
            print(f"Вантаж вагою {вага} кг завантажено.")
        else:
            print(f"Помилка: вантаж перевищує максимальну вантажопідйомність {self.макс_вантажопідйомність} кг.")
