package Lab3.Brazhnyk.KI304;

/**
 * Інтерфейс Loadable для об'єктів, які можуть завантажувати та вивантажувати вантаж.
 * 
 * Цей інтерфейс надає методи для взаємодії з вантажем, зокрема для завантаження,
 * вивантаження та перевірки поточного стану вантажу.
 * 
 * Реалізація цього інтерфейсу дозволяє об'єктам, таким як вантажівки чи інші
 * транспортні засоби, маніпулювати вантажем.
 */
public interface Loadable {
    
    /**
     * Завантажує вказану кількість вантажу.
     *
     * @param weight вага вантажу, що додається (в кілограмах).
     */
    void load(int weight);

    /**
     * Вивантажує вказану кількість вантажу.
     *
     * @param weight вага вантажу, що вивантажується (в кілограмах).
     */
    void unload(int weight);

    /**
     * Перевіряє поточний стан вантажу.
     * Виводить інформацію про поточну кількість вантажу.
     */
    void checkLoad();
}
